export interface IPropertyItem {
  value: string;
  description?: string;
  experience?: string;
  id: number;
}

export interface IPropertyCategory {
  category: string;
  items: IPropertyItem[];
}

export type IPlayerCard = {
  age: string | null;
  profession: string | null;
  health: string | null;
  fobia: string | null;
  hobbie: string | null;
  bandage: string | null;
  action: string | null;
  fact: string | null;
};

export type UsedCards = {
  age: Set<string>;
  profession: Set<string>;
  health: Set<string>;
  fobia: Set<string>;
  hobbie: Set<string>;
  bandage: Set<string>;
  action: Set<string>;
  fact: Set<string>;
};

export const PROPERTY_CATEGORIES: IPropertyCategory[] = [
  {
    category: 'bandage',
    items: [
      { id: 1, value: 'Аптечка' },
      { id: 2, value: 'Тушёнка' },
      { id: 3, value: 'Винтовка с патроном' },
      { id: 4, value: 'Детектор' },
      { id: 5, value: 'Журналы STALBOY' },
      { id: 6, value: 'Кастрюля' },
      { id: 7, value: 'Лом' },
      { id: 8, value: 'Легендарный Осколок 15' },
      { id: 9, value: 'Гитара' },
      { id: 10, value: 'Фляга мутная' },
      { id: 11, value: 'Носок с болтами' },
      { id: 12, value: 'Кукла из тряпок (называет её «командиром»)' },
      { id: 13, value: 'Пачка жвачки' },
      { id: 14, value: 'Картофель в мешке' },
      { id: 15, value: 'Стопка карты Таро' },
      { id: 16, value: 'Пластмассовый пистолет' },
      { id: 17, value: 'Половина карты Зоны с пометками' },
      {
        id: 18,
        value:
          'Рюкзак с 3 банками тушёнки и одной загадочной банкой без этикетки',
      },
      { id: 19, value: 'Самопальный дробовик' },
      { id: 20, value: 'Две дохлые крысы' },
      { id: 21, value: 'Игрушка кровососа' },
      { id: 22, value: 'Банка майонеза «Провансаль» 1998 года.' },
      { id: 23, value: 'Детская лопатка' },
      { id: 24, value: 'Медальон в виде кабана' },
      { id: 25, value: 'Бутылка «Чистого неба» - самогон' },
      { id: 26, value: 'Отрезанное ухо' },
    ],
  },
  {
    category: 'action',
    items: [
      {
        id: 27,
        value: 'Обмен судьбами',
        description:
          'выбери двух игроков, они меняются всеми открытыми картами',
      },
      {
        id: 28,
        value: 'Выборочный обмен',
        description: 'обменяй одну характеристику с любым игроком.',
      },
      {
        id: 29,
        value: 'Подозрение',
        description:
          'один из игроков по твоему выбору обязан немедленно раскрыть одну случайную закрытую характеристику.',
      },
      {
        id: 30,
        value: 'Проверка досье',
        description:
          'посмотри любую одну закрытую характеристику любого игрока (раскрывать не обязательно).',
      },
      {
        id: 31,
        value: 'Атака на репутацию',
        description:
          'один из игроков теряет право говорить до конца текущего круга обсуждения.',
      },
      {
        id: 32,
        value: 'Реинкарнация',
        description: 'измени свой возраст, вытянув новый из колоды.',
      },
      {
        id: 33,
        value: 'Переквалификация',
        description: 'замени свою профессию на новую, вытянув случайную.',
      },
      {
        id: 34,
        value: 'Фобия исчезла',
        description: 'избавься от своей фобии.',
      },
      {
        id: 35,
        value: 'Сброс здоровья',
        description: 'всем игрокам приходится вытянуть новое здоровье.',
      },
      {
        id: 36,
        value: 'Второй шанс',
        description: 'верни одного ранее изгнанного игрока обратно в игру.',
      },
      {
        id: 37,
        value: 'Иммунитет',
        description: 'на один раунд ты не можешь быть изгнан.',
      },
      {
        id: 38,
        value: 'Тайное знание',
        description: 'посмотри одну характеристику любого одного игрока.',
      },
      {
        id: 39,
        value: 'Перезапуск',
        description:
          'каждый игрок сбрасывает одну свою открытую характеристику и вытягивает новую взамен',
      },
      {
        id: 40,
        value: 'Исповедь',
        description:
          'выбери любого игрока: он должен сам добровольно раскрыть одну из своих закрытых характеристик (на выбор).',
      },
      {
        id: 41,
        value: 'Генная терапия',
        description:
          'можешь поменять любую одну характеристику (здоровья или фобии) у любого игрока (в том числе себя) на случайную из колоды.',
      },
      {
        id: 42,
        value: 'Наследие',
        description:
          'если ты будешь изгнан — твоя профессия или навык перейдёт к игроку, сидящему справа.',
      },
      {
        id: 43,
        value: 'Религиозный фанатизм',
        description:
          'ты объявляешь себя пророком. До конца игры можешь отменить одно решение голосования (один раз за игру).',
      },
      {
        id: 44,
        value: 'Экспериментальное лечение',
        description:
          'Выбери одного игрока. Он может вылечить своё текущее заболевание (если есть), но с шансом 50% получает новую фобию (вытягивается случайно).',
      },
    ],
  },
  {
    category: 'fact',
    items: [
      { id: 45, value: 'Иммунитет к легкой радиации' },
      { id: 46, value: 'Спасал сталкеров' },
      { id: 47, value: 'Работал на учёных' },
      { id: 48, value: 'Слышит голоса Зоны' },
      { id: 49, value: 'Ориентируется по звёздам' },
      { id: 50, value: 'Был в плену у бандитов' },
      { id: 51, value: 'Пережил выброс на поверхность' },
      { id: 52, value: 'Никогда не пьёт алкоголь' },
      { id: 53, value: 'Чует артефакты' },
      { id: 54, value: 'Был женат на мутантке' },
      { id: 55, value: 'Умеет петь так, что мутанты замирают' },
      { id: 56, value: 'Когда злится — начинает светиться' },
      { id: 57, value: 'Всегда спотыкается, но выживает' },
      { id: 58, value: 'Считает себя «избранным Зоной»' },
      { id: 59, value: 'Есть 3 псевдособаки' },
      { id: 60, value: 'Никогда не проигрывал в «камень-ножницы-бумага»' },
      { id: 61, value: 'Можете подержать дыхание 5 минут' },
      { id: 62, value: 'Ненавидит болты, кидает камни' },
      { id: 63, value: 'Был в эпицентре пси-удара и теперь слышит смех' },
      { id: 64, value: 'Постоянно разговаривает сам с собой' },
      { id: 65, value: 'Один раз съел документ и выжил' },
      { id: 66, value: 'Знает рецепт идеального супа из мутанта' },
      { id: 67, value: 'Боится тишины — всегда бубнит себе под нос' },
      { id: 68, value: 'Верит, что в Зоне есть инопланетяне' },
      { id: 69, value: 'Умеет засыпать стоя' },
      { id: 70, value: 'Считает, что все вокруг уже мертвы, кроме него' },
    ],
  },
  {
    category: 'fobia',
    items: [
      {
        id: 71,
        value: 'Агорафобия',
        description: 'Боится открытых пространств',
      },
      {
        id: 72,
        value: 'Мусофобия',
        description: 'Фобия мутантов-крыс "говорят, они смотрят в душу"',
      },
      { id: 73, value: 'Артефактофобия' },
      { id: 74, value: 'Никтофобия', description: 'Боится тёмных помещений' },
      { id: 75, value: 'Гидрофобия', description: 'Боится воды' },
      { id: 76, value: 'Некрофобия', description: 'Боится трупов' },
      { id: 77, value: 'Пирофобия', description: 'Фобия огня' },
      {
        id: 78,
        value: 'Электрофобия',
        description: 'Боится электричества и проводов',
      },
      { id: 79, value: 'Аутофобия', description: 'Фобия одиночества' },
      {
        id: 80,
        value: 'Боится собственной тени',
        description: 'Подозревает, что она мутировала',
      },
      {
        id: 81,
        value: 'Боязнь тушёнки',
        description: 'Однажды увидел там голову пси-крысы',
      },
      { id: 82, value: 'Боится громкого смеха' },
      { id: 83, value: 'Боится женщин-сталкеров' },
      { id: 84, value: 'Фобия ржавчины', description: 'Кричит при виде неё' },
      { id: 85, value: 'Фобия кустов', description: 'Вдруг там не тот куст' },
      {
        id: 86,
        value: 'Мутантообнимофобия',
        description:
          'Иррациональный страх, что мутанты хотят тебя не убить, а обнять.',
      },
      {
        id: 87,
        value: 'Аномалофобия',
        description:
          'Боязнь ступить даже на обычную лужу, думая, что это «аномалия».',
      },
      {
        id: 88,
        value: 'Грибофобия',
        description:
          'Паника при виде грибов, ведь каждый гриб может быть заражён «зонной плесенью».',
      },
      {
        id: 89,
        value: 'Кровосософобия',
        description:
          'Паника даже при виде человека с капюшоном («ну всё, кровосос»).',
      },
      {
        id: 90,
        value: 'Бункерофобия',
        description: 'Ироничный страх сидеть в бункере: «а вдруг он рухнет?».',
      },
      {
        id: 91,
        value: 'Звукофобия',
        description: 'Ужас от каждого писка детектора («Это точно пекашер!»).',
      },
      {
        id: 92,
        value: 'Засадофобия 2.0',
        description: 'Любое движение кустов = 100% засада',
      },
      {
        id: 93,
        value: 'Бункерное эхо-фобия',
        description:
          'страх своих же шагов в тоннеле («там кто-то идёт за мной»).',
      },
      { id: 94, value: 'НПСофобия' },
      {
        id: 95,
        value: 'Лабиринтофобия',
        description: 'Постоянный страх потерять вкусности для арсена',
      },
    ],
  },
  {
    category: 'health',
    items: [
      {
        id: 96,
        value: 'Одноглазый',
        description: 'после встречи с «химеров»',
        experience: 'Тяжёлая форма',
      },
      {
        id: 97,
        value: 'Хромота',
        description: 'очередная гранатка',
        experience: 'Средняя форма',
      },
      {
        id: 98,
        value: 'Лёгкая радиационная болезнь',
        description: 'постоянно кашляет после контакта с зоной',
        experience: 'Лёгкая форма',
      },
      {
        id: 99,
        value: 'Аллергия на артефакты',
        description: 'задхается если в карманах нет артифакта',
      },
      { id: 100, value: 'Частичная глухота' },
      {
        id: 101,
        value: 'Хроническая бессонница',
        description: 'не может спать, видит выбрас заранее',
      },
      {
        id: 102,
        value: 'Лёгкая мутация',
        description: 'Небольной хвостик как у химеры в журнале',
      },
      { id: 103, value: 'Тремор рук', description: '2%-67%' },
      {
        id: 104,
        value: 'Укушенный плотью',
        description:
          'Вроде жив, а вроде разлогается (проценты от 10 до 60 - рандом)',
      },
      { id: 105, value: 'Потеря нюха' },
      {
        id: 106,
        value: 'Синдром вечного голода',
        description: 'жрёт всё, даже кирпичи',
      },
      {
        id: 107,
        value: 'Случайный тик',
        description: 'подёргивается в самые страшные моменты',
      },
      {
        id: 108,
        value: 'Светоотражатель',
        description: 'кожа блестит как светоотражатель, какая-то новая мутация',
      },
      { id: 109, value: 'Хвост', description: 'отросток, невсегда из копчика' },
      {
        id: 110,
        value: 'Артефактная зависимость',
        description: 'чувство, что без артефакта ты умираешь.',
      },
      {
        id: 111,
        value: 'Аномалитоз',
        description: 'постоянные видения аномалий даже вне опасных зон',
      },
      {
        id: 112,
        value: 'Эхо-шепот',
        description: 'слышишь голоса мутантов или прошлых сталкеров',
      },
      {
        id: 113,
        value: 'Кристальная аллергия',
        description:
          'температура и озноб при слишком близком контакте с кристаллами изнанки',
      },
      {
        id: 114,
        value: 'Электро-чесотка',
        description: 'ощущение маленьких электрических разрядов по коже.',
      },
      {
        id: 115,
        value: 'Резонансная дрожь',
        description: 'тело вибрирует при прохождении через сильные пси-волны.',
      },
      {
        id: 116,
        value: 'Пузырчатый шок',
        description:
          'кожа покрывается странными пузырями при контакте с мутантскими жидкостями.',
      },
      {
        id: 117,
        value: 'Липкая дрожь',
        description:
          'руки и тело будто покрываются невидимой липкой пленкой после контакта с мутантами.',
      },
      {
        id: 118,
        value: 'Не регает',
        description: 'стреляет всегда в голову, но...',
      },
      {
        id: 119,
        value: 'Пузострел',
        description: 'не видит ничего больше пуза врага',
      },
      { id: 120, value: 'Идельный боец' },
    ],
  },
  {
    category: 'hobbie',
    items: [
      { id: 121, value: 'Ведёт дневник выжившего', experience: '1 месяц' },
      {
        id: 122,
        value: 'Пытается писать песни о Зоне',
        experience: '2 месяца',
      },
      { id: 123, value: 'Рисует карты тропинок', experience: '3 месяца' },
      {
        id: 124,
        value: 'Делает фигурки из костей мутантов',
        experience: '4 месяца',
      },
      {
        id: 125,
        value: 'Варит «самопальное пиво» из всего подряд',
        experience: '5 месяцев',
      },
      {
        id: 126,
        value: 'Придумывает название новым аномалиям',
        experience: '10 месяцев',
      },
      {
        id: 127,
        value: 'Умеет готовиться на костре даже из тухляка',
        experience: '9 месяцев',
      },
      { id: 128, value: 'Починка оружия на коленке', experience: '6 месяца' },
      {
        id: 129,
        value: 'Меткий бросок болтов в аномалии',
        experience: '7 месяца',
      },
      {
        id: 130,
        value: 'Перевязка ран из подручных средств',
        experience: '8 месяцев',
      },
      { id: 131, value: 'Знание троп', experience: '1 год' },
      { id: 132, value: 'Умеет ставить ловушки', experience: '2 года' },
      { id: 133, value: 'Специалист по радиосвязи', experience: '3 года' },
      { id: 134, value: 'Рисует комиксы о мутантах', experience: '4 года' },
      {
        id: 135,
        value: 'Заводит воображаемых друзей и зовёт их в рейды',
        experience: '5 лет',
      },
      {
        id: 136,
        value: 'Умеет подражать звукам мутантов',
        experience: '6 лет',
      },
      { id: 137, value: 'Играет на гитаре', experience: '7 лет' },
      { id: 138, value: 'Можно отмыкать замки ногтем', experience: '8 лет' },
      { id: 139, value: 'Ориентируется по мухаму', experience: '9 лет' },
      {
        id: 140,
        value: 'Делает самопальные гранаты из всего',
        experience: '10 лет',
      },
      { id: 141, value: 'Знает все анекдоты про Зону', experience: '11 лет' },
      {
        id: 142,
        value: 'Умение ставить палатки даже в бетонном бункере.',
        experience: '12 лет',
      },
      {
        id: 143,
        value: 'Сборка самопального огнемёта из трех деталей',
        experience: '13 лет',
      },
      {
        id: 144,
        value: 'Настройка ПДА без интернета и элек',
        experience: '14 лет',
      },
      { id: 145, value: 'Мастер по чтению мыслей собак', experience: '15 лет' },
      { id: 146, value: 'Ловля крысы руками быстрее, чем кошка' },
      { id: 147, value: 'Опытный переговорщик с кровососами' },
      { id: 148, value: 'Танцор диско' },
      { id: 149, value: 'Умение жонглировать гранатами (без чеки)' },
      { id: 150, value: 'Разборка/сборка автоматов «для души»' },
      { id: 151, value: 'Слежка за движением аномалий' },
      { id: 152, value: 'Торговля тушёнкой на чёрном рынке' },
      { id: 153, value: 'Ремонт противогазов' },
      { id: 154, value: 'Постройка укрытий в неожиданных местах.' },
      { id: 155, value: 'Селфи с каждым мутантом' },
      { id: 156, value: 'Создание фан-клуба кровососов' },
      { id: 157, value: 'Подделка паспортов для кабанов' },
    ],
  },
  {
    category: 'age',
    items: [
      { id: 158, value: '18 лет' },
      { id: 159, value: '19 лет' },
      { id: 160, value: '20 лет' },
      { id: 161, value: '21 год' },
      { id: 162, value: '22 года' },
      { id: 163, value: '23 года' },
      { id: 164, value: '24 года' },
      { id: 165, value: '25 лет' },
      { id: 166, value: '26 лет' },
      { id: 167, value: '27 лет' },
      { id: 168, value: '28 лет' },
      { id: 169, value: '29 лет' },
      { id: 170, value: '30 лет' },
      { id: 171, value: '31 год' },
      { id: 172, value: '32 года' },
      { id: 173, value: '33 года' },
      { id: 174, value: '34 года' },
      { id: 175, value: '35 лет' },
      { id: 176, value: '36 лет' },
      { id: 177, value: '37 лет' },
      { id: 178, value: '38 лет' },
      { id: 179, value: '39 лет' },
      { id: 180, value: '40 лет' },
      { id: 181, value: '41 год' },
      { id: 182, value: '42 года' },
      { id: 183, value: '43 года' },
      { id: 184, value: '44 года' },
      { id: 185, value: '45 лет' },
      { id: 186, value: '46 лет' },
      { id: 187, value: '47 лет' },
      { id: 188, value: '48 лет' },
      { id: 189, value: '49 лет' },
      { id: 190, value: '50 лет' },
      { id: 191, value: '51 год' },
      { id: 192, value: '52 года' },
      { id: 193, value: '53 года' },
      { id: 194, value: '54 года' },
      { id: 195, value: '55 лет' },
      { id: 196, value: '56 лет' },
      { id: 197, value: '57 лет' },
      { id: 198, value: '58 лет' },
      { id: 199, value: '59 лет' },
      { id: 200, value: '60 лет' },
    ],
  },
  {
    category: 'profession',
    items: [
      { id: 201, value: 'Медик Зоны' },
      { id: 202, value: 'Учёный-аномалист' },
      { id: 203, value: 'Перекупщик артефактов' },
      { id: 204, value: 'Пси-«психолог»' },
      { id: 205, value: 'Гид по Зоне' },
      { id: 206, value: 'Официальный дегустатор тушёнки' },
      { id: 207, value: 'Коллекционер ржавых болтов' },
      { id: 208, value: 'Болотник' },
      { id: 209, value: 'Пекашер' },
      { id: 210, value: 'Вор закупов' },
      { id: 211, value: 'Охранник застоя' },
      { id: 212, value: 'Отчаянный скамер' },
      { id: 213, value: 'Киселевый барон' },
      { id: 214, value: 'На все руки мастер (вкачал всю убежку)' },
      { id: 215, value: 'Кландайская шавка' },
      { id: 216, value: 'Дегустатор мутантской кухни' },
      { id: 217, value: 'Тренер по бегу от выбросов' },
      { id: 218, value: 'Переводчик с языка мутантов' },
      { id: 219, value: 'Сталкерский бард' },
      { id: 220, value: 'Коллекционер паков' },
      { id: 221, value: 'Барикадир' },
      { id: 222, value: 'Настоящий гренадёр' },
    ],
  },
];
